Repository: Xiaoli-git2025/cst2335_groupproject
Catalog: lib/l10n/app_*.arb
Languages: tr, zh

# main_title
source: Flight Reservation Management
tr: Uçuş Rezervasyon Yönetimi
zh: 航班预定管理

# main_lab_customer_list
source: Customer List
tr: Müşteri Listesi
zh: 客户信息列表

# main_lab_airplane_list
source: Airplane List
tr: Uçak Listesi
zh: 飞机信息列表

# main_lab_flight_list
source: Flight List
tr: Uçuş Listesi
zh: 航班信息列表

# main_lab_sales_list
source: Reservation List
tr: Rezervasyon Listesi
zh: 航班预定列表

source: Yes
tr: Evet
zh: 是

source: No
tr: Hayır
zh: 否

# menu_help
source: Instructions
tr: Talimatlar
zh: 用户指南

# flightsListTitle
source: Flights List
tr: Uçuş Listesi

# addFlightTitle
source: Add New Flight
tr: Yeni Uçuş Ekle

source: Departure City
tr: Kalkış Şehri

source: Destination City
tr: Varış Şehri

source: Departure Time
tr: Kalkış Saati

source: Arrival Time
tr: Varış Saati

source: Cancel
tr: İptal

source: Add
tr: Ekle

# fillAllFields
source: Please fill all fields
tr: Lütfen tüm alanları doldurun

source: Flight added
tr: Uçuş eklendi

# noFlights
source: No flights found.
tr: Uçuş bulunamadı.

source: Departs
tr: Kalkış

source: Arrives
tr: Varış

source: Instructions
tr: Talimatlar

# flightInstructions
source: Use the + button to add flights. Tap a flight to see details or update/delete it.
tr: + butonunu kullanarak uçuş ekleyin. Bir uçuşa dokunarak detayları görebilir veya güncelleyebilirsiniz.

source: OK
tr: Tamam

source: Error loading flights
tr: Uçuşlar yüklenirken hata oluştu

# title_sales
source: Reservation List
tr: Rezervasyon Listesi
zh: 航班预定

# title_sales_items
source: Reservation Details
tr: Rezervasyon Detayları
zh: 航班预定信息详情

# msg_sales_no_item
source: There are no items in the list.
tr: Listede herhangi bir kayıt yok.
zh: 航班预定列表为空

# msg_sales_add
source: Add Reservation
tr: Rezervasyon Ekle
zh: 添加预定

# msg_sales_add_choice
source: Do you want to copy the previous item's data?
tr: Önceki kaydın verilerini kopyalamak istiyor musunuz?
zh: 是否拷贝上一次添加的记录信息？

# title_sales_delete
source: Delete Item
tr: Kaydı Sil
zh: 删除预定记录

# msg_sales_delete_confirm
source: Are you sure you want to delete this item?
tr: Bu kaydı silmek istediğinize emin misiniz?
zh: 确定删除预定记录么？

# lbl_sales_customer_id
source: Customer ID
tr: Müşteri ID
zh: 客户号

# lbl_sales_customer_name
source: Customer Name
tr: Müşteri Adı
zh: 客户姓名

# lbl_sales_flight_id
source: Flight ID
tr: Uçuş ID
zh: 航班号

# lbl_sales_depart_city
source: Depart City
tr: Kalkış Şehri
zh: 出发城市

# lbl_sales_destination_city
source: Destination City
tr: Varış Şehri
zh: 目的城市

# lbl_sales_depart_time
source: Depart Time
tr: Kalkış Saati
zh: 出发时间

# lbl_sales_arrive_time
source: Arrive Time
tr: Varış Saati
zh: 到达时间

# lbl_sales_reservation_name
source: Reservation Name
tr: Rezervasyon Adı
zh: 预定名称

# lbl_sales_purchase_date
source: Flight Date
tr: Uçuş Tarihi
zh: 航班日期

# lbl_sales_id
source: Record ID
tr: Kayıt ID
zh: 记录号

# lbl_sales_delete
source: Delete
tr: Sil
zh: 删除

# lbl_sales_close
source: Close
tr: Kapat
zh: 关闭

# title_sales_help
source: How to Use
tr: Kullanım Talimatları
zh: 用户使用指南

# msg_sales_help_description
source: 1. Enter customer, flight ID, and flight date. 2. Tap 'Add' to save the reservation. 3. Tap a list item to view details or delete it. 4. Use the back button to return to the main menu.
tr: 1. Müşteri, uçuş ID ve uçuş tarihini girin. 2. Kaydetmek için 'Ekle' butonuna dokunun. 3. Detayları görmek veya silmek için bir kayda dokunun. 4. Ana menüye dönmek için geri butonunu kullanın.
zh: 1. 输入客户号，航班号及航班日期。 2. 点击‘添加预定’按钮添加预定记录。 3. 点击一条预定记录查看详情。 4. 点击返回键返回主界面。

# title_airplane
source: Airplane List
tr: Uçak Listesi
zh: 飞机信息列表

# airplane_max_passengers
source: Max Passengers
tr: Maksimum Yolcu
zh: 最大乘客数

# airplane_max_speed
source: Max Speed
tr: Maksimum Hız
zh: 最大速度

# airplane_max_mileage
source: Max Mileage
tr: Maksimum Menzil
zh: 最大里程

source: Add Airplane
tr: Uçak Ekle
zh: 添加飞机

# airplane_message_no_items
source: There are no more records.
tr: Daha fazla kayıt yok.
zh: 没有更多记录了

# airplane_message_selected_item
source: Select an item
tr: Bir öğe seçin
zh: 请选择一条记录

# airplane_save_list
source: Save List
tr: Listeyi Kaydet
zh: 保存记录

# airplane_save_list_message
source: Do you want to save this list?
tr: Bu listeyi kaydetmek istiyor musunuz?
zh: 是否保存此列表？

# airplane_save_list_yes
source: Yes
tr: Evet
zh: 是

# airplane_save_list_no
source: No
tr: Hayır
zh: 否

# airplane_update
source: Update Airplane
tr: Uçak Güncelle
zh: 更新飞机信息

# airplane_delete_button
source: Delete
tr: Sil
zh: 删除

# airplane_cancel_button
source: Cancel
tr: İptal
zh: 取消

# airplane_update_button
source: update
tr: Güncelle
zh: 更新

# airplane_question_title
source: How to Use
tr: Kullanım Talimatları
zh: 用户使用指南

# airplane_question_instruction
source: 1. Enter the airplane details. 2. Tap 'Add' to save the airplane. 3. Select an item from the list to update or delete it. 4. Use the back button to return to the main menu.
tr: 1. Uçak bilgilerini girin. 2. Kaydetmek için 'Ekle' butonuna dokunun. 3. Güncellemek veya silmek için listeden bir öğe seçin. 4. Ana menüye dönmek için geri butonunu kullanın.
zh: 1. 输入飞机信息 2. 点击‘添加飞机’按钮保存飞机信息 3. 选择列表中的一条记录进行更新或删除 4. 点击返回键返回主界面

# airplane_question_button
source: close
tr: Kapat
zh: 关闭

# airplane_error_message_String
source: Please enter model in type of String.
tr: Lütfen modeli metin olarak giriniz.

# airplane_error_message_Number
source: Please enter in type of Number.
tr: Lütfen sayısal bir değer giriniz.
zh: 请输入数字

# noRecords
source: No customer records found
tr: Müşteri kaydı bulunamadı
zh: 未找到客户记录

# customerAdd
source: Customer added successfully
tr: Müşteri başarıyla eklendi
zh: 成功添加客户

# customerUpdate
source: Customer updated successfully
tr: Müşteri başarıyla güncellendi
zh: 成功更新客户

source: delete
tr: Sil
zh: 删除

# deleteMessage
source: Are you sure you want to delete this customer?
tr: Bu müşteriyi silmek istediğinize emin misiniz?
zh: 你确定你要删除这个客户嘛?

# no_customer
source: No
tr: Hayır
zh: 否

# yes_customer
source: Yes
tr: Evet
zh: 是

# customerDelete
source: Customer deleted
tr: Müşteri silindi
zh: 客户被删除

source: First Name
tr: Ad
zh: 名

source: Last Name
tr: Soyad
zh: 姓

source: Address
tr: Adres
zh: 地址

source: Date of Birth
tr: Doğum Tarihi
zh: 出生日期

source: Copy Last
tr: Sonuncuyu Kopyala
zh: 复制之前客户

source: Cancel Edit
tr: Düzenlemeyi İptal Et
zh: 取消编辑

source: Customer List
tr: Müşteri Listesi
zh: 客户名单

# instrcution_customer
source: instructions
tr: Talimatlar
zh: 操作说明

# instruction1
source: • Fill in customer details using the form.
tr: • Formu kullanarak müşteri bilgilerini doldurun.
zh: • 在名单里填写客户信息.

# instruction2
source: • Tap Add Customer to save to the database.
tr: • Veritabanına kaydetmek için Müşteri Ekle'ye dokunun.
zh: • 按 添加客户 存储信息.

# instruction3
source: • Tap on a customer to view/edit details.
tr: • Detayları görmek/düzenlemek için bir müşteriye dokunun.
zh: • 按客户名单编辑

# instruction4
source: • Tap Copy Last to reuse last customer data.
tr: • Son müşteri verilerini yeniden kullanmak için Sonuncuyu Kopyala'ya dokunun.
zh: • 按 复制之前客户 使用之前信息.

# customerClose
source: Close
tr: Kapat
zh: 关闭

source: Add Customer
tr: Müşteri Ekle
zh: 添加客户

# saveCustomer
source: Save Change
tr: Değişiklikleri Kaydet
zh: 保存修改

# detail
source: Item Details
tr: Kayıt Detayları
zh: 客户信息

# airplane_model
source: Model
zh: 型号
